---
kind: property
id: P:Autodesk.Revit.DB.ParameterTypeId.StructuralFamilyCodeName
source: html/b9b167aa-a9e6-2dcd-6791-f88ba411d16f.htm
---
# Autodesk.Revit.DB.ParameterTypeId.StructuralFamilyCodeName Property

"Code Name"

## Syntax (C#)
```csharp
public static ForgeTypeId StructuralFamilyCodeName { get; }
```